In [11]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine
from sqlalchemy import text
import mysql.connector
from getpass import getpass

In [5]:
pwd = getpass()

In [7]:
# create connection

bd = "sakila"
connection_string = 'mysql+pymysql://root:' + pwd + '@localhost/' + bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [24]:
with engine.connect() as connection:
    query = text('SELECT * FROM rental')
    result = connection.execute(query)

In [ ]:
## cursor result which needs to be converted. after every run it is closed.. therefore you need to run the above function again.
result

In [25]:
row = result.first()

In [ ]:
# this creates dictionary to call the items from dictt..
row._mapping

{'rental_id': 1, 'rental_date': datetime.datetime(2005, 5, 24, 22, 53, 30), 'inventory_id': 367, 'customer_id': 130, 'return_date': datetime.datetime(2005, 5, 26, 22, 4, 30), 'staff_id': 1, 'last_update': datetime.datetime(2006, 2, 15, 21, 30, 53)}

In [ ]:
# dictionaries in row format
with engine.connect() as connection:
    query = text('''SELECT *, DATE_FORMAT(rental_date, '%Y') as year, DATE_FORMAT(rental_date, '%m') as month FROM rental LIMIT 10;''')
    result = connection.execute(query)
    for row in result.mappings():
        print(row)

{'rental_id': 1, 'rental_date': datetime.datetime(2005, 5, 24, 22, 53, 30), 'inventory_id': 367, 'customer_id': 130, 'return_date': datetime.datetime(2005, 5, 26, 22, 4, 30), 'staff_id': 1, 'last_update': datetime.datetime(2006, 2, 15, 21, 30, 53), 'year': '2005', 'month': '05'}
{'rental_id': 2, 'rental_date': datetime.datetime(2005, 5, 24, 22, 54, 33), 'inventory_id': 1525, 'customer_id': 459, 'return_date': datetime.datetime(2005, 5, 28, 19, 40, 33), 'staff_id': 1, 'last_update': datetime.datetime(2006, 2, 15, 21, 30, 53), 'year': '2005', 'month': '05'}
{'rental_id': 3, 'rental_date': datetime.datetime(2005, 5, 24, 23, 3, 39), 'inventory_id': 1711, 'customer_id': 408, 'return_date': datetime.datetime(2005, 6, 1, 22, 12, 39), 'staff_id': 1, 'last_update': datetime.datetime(2006, 2, 15, 21, 30, 53), 'year': '2005', 'month': '05'}
{'rental_id': 4, 'rental_date': datetime.datetime(2005, 5, 24, 23, 4, 41), 'inventory_id': 2452, 'customer_id': 333, 'return_date': datetime.datetime(2005, 6, 3, 1, 43, 41), 'staff_id': 2, 'last_update': datetime.datetime(2006, 2, 15, 21, 30, 53), 'year': '2005', 'month': '05'}
{'rental_id': 5, 'rental_date': datetime.datetime(2005, 5, 24, 23, 5, 21), 'inventory_id': 2079, 'customer_id': 222, 'return_date': datetime.datetime(2005, 6, 2, 4, 33, 21), 'staff_id': 1, 'last_update': datetime.datetime(2006, 2, 15, 21, 30, 53), 'year': '2005', 'month': '05'}
{'rental_id': 6, 'rental_date': datetime.datetime(2005, 5, 24, 23, 8, 7), 'inventory_id': 2792, 'customer_id': 549, 'return_date': datetime.datetime(2005, 5, 27, 1, 32, 7), 'staff_id': 1, 'last_update': datetime.datetime(2006, 2, 15, 21, 30, 53), 'year': '2005', 'month': '05'}
{'rental_id': 7, 'rental_date': datetime.datetime(2005, 5, 24, 23, 11, 53), 'inventory_id': 3995, 'customer_id': 269, 'return_date': datetime.datetime(2005, 5, 29, 20, 34, 53), 'staff_id': 2, 'last_update': datetime.datetime(2006, 2, 15, 21, 30, 53), 'year': '2005', 'month': '05'}
{'rental_id': 8, 'rental_date': datetime.datetime(2005, 5, 24, 23, 31, 46), 'inventory_id': 2346, 'customer_id': 239, 'return_date': datetime.datetime(2005, 5, 27, 23, 33, 46), 'staff_id': 2, 'last_update': datetime.datetime(2006, 2, 15, 21, 30, 53), 'year': '2005', 'month': '05'}
{'rental_id': 9, 'rental_date': datetime.datetime(2005, 5, 25, 0, 0, 40), 'inventory_id': 2580, 'customer_id': 126, 'return_date': datetime.datetime(2005, 5, 28, 0, 22, 40), 'staff_id': 1, 'last_update': datetime.datetime(2006, 2, 15, 21, 30, 53), 'year': '2005', 'month': '05'}
{'rental_id': 10, 'rental_date': datetime.datetime(2005, 5, 25, 0, 2, 21), 'inventory_id': 1824, 'customer_id': 399, 'return_date': datetime.datetime(2005, 5, 31, 22, 44, 21), 'staff_id': 2, 'last_update': datetime.datetime(2006, 2, 15, 21, 30, 53), 'year': '2005', 'month': '05'}

In [ ]:
# this is the tuple version
with engine.connect() as connection:
    #query = defined above
    result = connection.execute(query)
    for row in result:
        print(row)

(1, datetime.datetime(2005, 5, 24, 22, 53, 30), 367, 130, datetime.datetime(2005, 5, 26, 22, 4, 30), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05')
(2, datetime.datetime(2005, 5, 24, 22, 54, 33), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05')
(3, datetime.datetime(2005, 5, 24, 23, 3, 39), 1711, 408, datetime.datetime(2005, 6, 1, 22, 12, 39), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05')
(4, datetime.datetime(2005, 5, 24, 23, 4, 41), 2452, 333, datetime.datetime(2005, 6, 3, 1, 43, 41), 2, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05')
(5, datetime.datetime(2005, 5, 24, 23, 5, 21), 2079, 222, datetime.datetime(2005, 6, 2, 4, 33, 21), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05')
(6, datetime.datetime(2005, 5, 24, 23, 8, 7), 2792, 549, datetime.datetime(2005, 5, 27, 1, 32, 7), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05')
(7, datetime.datetime(2005, 5, 24, 23, 11, 53), 3995, 269, datetime.datetime(2005, 5, 29, 20, 34, 53), 2, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05')
(8, datetime.datetime(2005, 5, 24, 23, 31, 46), 2346, 239, datetime.datetime(2005, 5, 27, 23, 33, 46), 2, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05')
(9, datetime.datetime(2005, 5, 25, 0, 0, 40), 2580, 126, datetime.datetime(2005, 5, 28, 0, 22, 40), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05')
(10, datetime.datetime(2005, 5, 25, 0, 2, 21), 1824, 399, datetime.datetime(2005, 5, 31, 22, 44, 21), 2, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05')

In [ ]:
# this is the way to get all values in a list:
with engine.connect() as connection:
    #query = text() defined
    result = connection.execute(query)
    print(result.all())

[(1, datetime.datetime(2005, 5, 24, 22, 53, 30), 367, 130, datetime.datetime(2005, 5, 26, 22, 4, 30), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05'), (2, datetime.datetime(2005, 5, 24, 22, 54, 33), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05'), (3, datetime.datetime(2005, 5, 24, 23, 3, 39), 1711, 408, datetime.datetime(2005, 6, 1, 22, 12, 39), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05'), (4, datetime.datetime(2005, 5, 24, 23, 4, 41), 2452, 333, datetime.datetime(2005, 6, 3, 1, 43, 41), 2, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05'), (5, datetime.datetime(2005, 5, 24, 23, 5, 21), 2079, 222, datetime.datetime(2005, 6, 2, 4, 33, 21), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05'), (6, datetime.datetime(2005, 5, 24, 23, 8, 7), 2792, 549, datetime.datetime(2005, 5, 27, 1, 32, 7), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05'), (7, datetime.datetime(2005, 5, 24, 23, 11, 53), 3995, 269, datetime.datetime(2005, 5, 29, 20, 34, 53), 2, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05'), (8, datetime.datetime(2005, 5, 24, 23, 31, 46), 2346, 239, datetime.datetime(2005, 5, 27, 23, 33, 46), 2, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05'), (9, datetime.datetime(2005, 5, 25, 0, 0, 40), 2580, 126, datetime.datetime(2005, 5, 28, 0, 22, 40), 1, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05'), (10, datetime.datetime(2005, 5, 25, 0, 2, 21), 1824, 399, datetime.datetime(2005, 5, 31, 22, 44, 21), 2, datetime.datetime(2006, 2, 15, 21, 30, 53), '2005', '05')]

In [47]:
# this way to get the df
def rental_months(connection, month, year):
    with engine.connect() as connection:
        txt = f''' SELECT * FROM rental WHERE MONTH(rental_date) IN ({month}) AND YEAR(rental_date) = {year};'''
        query = text(txt)
        result = connection.execute(query)
        df = pd.DataFrame(result.all())
    return df

In [49]:
rental_months(connection, '5,6', '2005')

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
3462,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
3463,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
3464,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
3465,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
3466,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

In [68]:
def rental_month_count(connection, month, year):
    df = rental_months(connection, month, year)
    df_groupped = df.groupby('customer_id').agg(
        **{f'rentals_{month}_{year}': ('rental_id', 'count')}
    ).reset_index().sort_values(by=f'rentals_{month}_{year}', ascending=False)

    return df_groupped

In [77]:
df1 = rental_month_count(connection, '05', '2005')
df2 = rental_month_count(connection, '06', '2005')

In [86]:
df1.iloc[:,1]

168    8
92     7
441    7
43     6
227    6
      ..
299    1
300    1
302    1
303    1
519    1
Name: rentals_05_2005, Length: 520, dtype: int64

In [98]:
def compare_rentals (df1, df2):
    df_diff = pd.merge(df1, df2, on='customer_id', how='outer').fillna(0)
    col1 = [col for col in df1.columns if col != 'customer_id'][0]
    col2 = [col for col in df2.columns if col != 'customer_id'][0]
    df_diff['difference'] = df_diff[col1] - df_diff[col2]
    return df_diff

In [96]:
compare_rentals(df1, df2)

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1              2.0              7.0        -5.0
1              2              1.0              1.0         0.0
2              3              2.0              4.0        -2.0
3              4              0.0              6.0        -6.0
4              5              3.0              5.0        -2.0
..           ...              ...              ...         ...
593          595              1.0              2.0        -1.0
594          596              6.0              2.0         4.0
595          597              2.0              3.0        -1.0
596          598              0.0              1.0        -1.0
597          599              1.0              4.0        -3.0

[598 rows x 4 columns]